In [31]:
import pandas as pd
import numpy as np

In [65]:
raw_data = {'employee_id': ['123456', '123453', '1238572', '123456', '123456'], 
        'yrs_of_experience': [24, 14, 10, 12, 5], 
        'yrs_at_company': [10, 7, 10, 3, 2], 
        'compensation': [1000000, 140000, 70000, 240000, 120000], 
        'career_track': ['tech', 'tech', 'non_tech', 'exec', 'tech']}

df = pd.DataFrame(raw_data, columns = ['employee_id', 'yrs_of_experience', 'yrs_at_company', 'compensation', 'career_track'])
df

  employee_id  yrs_of_experience  yrs_at_company  compensation career_track
0      123456                 24              10       1000000         tech
1      123453                 14               7        140000         tech
2     1238572                 10              10         70000     non_tech
3      123456                 12               3        240000         exec
4      123456                  5               2        120000         tech

In [66]:
min_years = df['yrs_at_company'].min()

In [67]:
max_years = df['yrs_at_company'].max()

In [68]:
i = 0
bins = []
while i <= max_years:
    bins.append(i)
    i += 5

In [69]:
bins

[0, 5, 10]

In [70]:
df['binned_years'] = pd.cut(df['yrs_at_company'], bins)

In [71]:
df.head()

,employee_id,yrs_of_experience,yrs_at_company,compensation,career_track,binned_years
0,123456,24,10,1000000,tech,"(5, 10]"
1,123453,14,7,140000,tech,"(5, 10]"
2,1238572,10,10,70000,non_tech,"(5, 10]"
3,123456,12,3,240000,exec,"(0, 5]"
4,123456,5,2,120000,tech,"(0, 5]"

In [78]:
df[['compensation', 'binned_years']].groupby("binned_years").agg([np.mean, np.min, np.max, np.median, np.std])

               compensation
                       mean    amin     amax  median            std
binned_years
(0, 5]        180000.000000  120000   240000  180000   84852.813742
(5, 10]       403333.333333   70000  1000000  140000  517912.476518

In [ ]:
min_years = df['yrs_at_company'].min()
max_years = df['yrs_at_company'].max()
i = 0
bins = []
while i <= max_years:
    bins.append(i)
    i += 5

df['binned_years'] = pd.cut(df['yrs_at_company'], bins)
df[['compensation', 'binned_years']].groupby("binned_years").agg([np.mean, np.min, np.max, np.median, np.std])